<?php
// 定数管理用ファイル

return [
    //-------テーブル見出し--------------------------
    'th' => [
        'name'  => '名前',
        'phone' => '電話番号',
        'email' => 'メールアドレス',
    ],
    //-------入力項目が空のときの表示文字列-----------
    'placeholder' => [
        'name'  => '名前',
        'phone' => '電話番号（ハイフンあり）',
        'email' => 'メールアドレス',
    ],
    //-------見出し（h1タグ）------------------------
    'h1' => [
        'add'   => '会員登録',
        'edit'  => '会員編集 会員ID：',
    ],
    //-------ボタンラベル----------------------------
    'button' => [
        'add'   => '登録',
        'edit'  => '編集',
        'del'   => '削除',
    ],
    //-------aタグの表示文字列-------
    'a' => [
        'add'   => '＞＞登録',
        'edit'  => '＞＞編集',
    ],
    //-------inputタグの入力制限(patter属性)-------
    'input_pattern' => [
        'phone'  => '\d{2,4}-\d{3,4}-\d{3,4}',
        'mail' => '^[a-zA-Z]{1}[0-9a-zA-Z]+[\w\.-]+@[\w\.-]+\.\w{2,}$',
    ],
];